// class 2.4.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

int main()
{
	system("mode con cols=80 lines=40");	//	mode /?	

	system("color A");
	system("color 13");	// 1表示背景背景，3表示字体颜色 
	/*	
		0 = 黑色		8 = 灰色
		1 = 蓝色		9 = 淡蓝色
		2 = 绿色		A = 淡灰色
		3 = 湖蓝色		B = 淡浅绿色
		4 = 红色		C = 淡红色
		5 = 紫色		D = 淡紫色
		6 = 黄色		E = 淡黄色
		7 = 白色		F = 亮白色
	*/

	printf("这是一个测试,关于printf!\n测试人员姓名:\"郝英俊\"");	//C语言
	
	system("D:\\docs.txt");

	system("shutdown /a"); //关机相关

	system("cls");	//cls clear screen

	system("shutdown /a"); //关机相关


	system("pause"); //Win+R

	std::cout << "这是一个测试,关于printf!\n";	//C++

   //std::cout << "Hello World!\n";
}

/* 
						***常用基础指令***
		———————————————————————————————
		| 函数(指令名)|			功能	|			示范			|
		|-------------|-----------------|---------------------------|
		|printf		  |屏幕上显示文字	|printf("要显示的内容");	|
		|system		  |执行系统命令		|system("pause"）)://暂停	|
		———————————————————————————————
		
						***特殊字符显示***
		_________________________________________________________
		|		字符			|			显示结果			|
		|-----------------------|-------------------------------|
		|		"\\"			|	\							|
		|		"\""			|	"							|
		|		"\'"			|	'							|
		|		"\n"			|	换行						|
		---------------------------------------------------------

					***system使用示范***
		_________________________________________________________________
		|功能                   |    命令								 |
		|-----------------------|----------------------------------------
		|暂停                   |    system("pause");					 |
		|清屏                   |    system("cls");						 |
		|设置控制台大小         |    system("mode con cols=宽 lines=高");|
		|设置控制台颜色         |    system("color 02");				 |
		------------------------------------------------------------------
*/